tutorials/rigidBodyAndBeam_fullTime/0/beam/explicitMQ
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2312                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       surfaceVectorField;
    location    "2";
    object      explicitMQ;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 2 -2 0 0 0 0];

internalField   nonuniform List<vector> 
59
(
(-6.48356e-26 -4.65049e-08 -1.55998e-21)
(3.25551e-26 2.78291e-08 8.11265e-22)
(-2.32293e-26 -1.66532e-08 -6.00309e-22)
(9.21736e-27 9.96547e-09 2.47363e-22)
(-7.38146e-27 -5.96346e-09 -2.06018e-22)
(1.98466e-27 3.5686e-09 5.77004e-23)
(-1.88839e-27 -2.13549e-09 -5.72883e-23)
(1.22454e-27 1.2779e-09 3.88377e-23)
...
)
;

boundaryField
{
    left
    {
        type            calculated;
        value           uniform (6.45637e-18 7.77138e-08 1.50796e-13);
    }
    right
    {
        type            calculated;
        value           uniform (6.45637e-18 -7.77176e-08 -1.50796e-13);
    }
    beam
    {
        type            empty;
        value           nonuniform List<vector> 0();
    }
}


// ************************************************************************* //
