tutorials/rigidBodyAndBeam_fullTime/constant/beam/beamProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.0                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      beamProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

beamModel coupledTotalLagNewtonRaphsonBeam;

nBeams 1;
R R [0 1 0 0 0 0 0] 4.0E-03;
L L [0 1 0 0 0 0 0] 2.6565;
nSegments 60;

beams
(
    beam_0
    {
        crossSectionModel    circle;

        circleCrossSectionModelDict
        {
            radius    4.0E-03;
        }

        length       2.6565;
        nSegments    60;
    }
);

"coupledTotalLagNewtonRaphsonBeamCoeffs"
{
    E E [1 -1 -2 0 0 0 0] 3.0E06;
    G G [1 -1 -2 0 0 0 0] 3.0E06;
    rho rho [1 -3 0 0 0 0 0] 1.14;
    rhoFluid rhoFluid [1 -3 0 0 0 0 0] 1;

    groundContactActive false;
    groundZ -2.0;
    gStiffness 1E04;
    gDamping 1.0;

    startPatchName left;
    endPatchName right;

    nCorrectors 200;
    convergenceTol 1e-10;

    debug yes;

    blockEigenForceCoupling true;
    blockEigenKinematicCoupling true;
    blockEigenKinematicCouplingMode staged;

    updatedLagrangian no;
    objectiveInterpolation false;
    steadyState false;
    newmark false;

    dragActive false;
    couplingActive false;

    Cdn 1.6;
    Cdt 0.05;
    CMn 1.0;
    CMt 0.0;
}

// ************************************************************************* //
