tutorials/rigidBodyAndBeam_fullTime/constant/beam/timeVsDisplacement
(
    ( 0 (0 0 0) )
    ( 3 (0 0 0) )
)
